In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df=pd.read_csv('tested.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
df.shape

(418, 12)

In [5]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [6]:
df['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [7]:
df.SibSp.value_counts()

0    283
1    110
2     14
3      4
4      4
8      2
5      1
Name: SibSp, dtype: int64

In [8]:
df.Parch.value_counts()

0    324
1     52
2     33
3      3
4      2
9      2
5      1
6      1
Name: Parch, dtype: int64

# Feature Engineering

#### Feature Construction

In [9]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [10]:
df['Family_size'] = df['SibSp'] + df['Parch'] + 1

In [11]:
def family(num):
    if num == 1:
        #alone
        return 0
    elif num >1 and num <=4:
        # small family
        return 1
    else:
        # large family
        return 2

In [12]:
df['Family_type'] = df['Family_size'].apply(family)

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_size,Family_type
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1,0
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,2,1
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1,0
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1,0
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,3,1

In [14]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_size,Family_type
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1,0
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,2,1
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1,0
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1,0
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,3,1

#### Feature Splitting

In [15]:
df['Name']

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

#### Adding column Title

In [16]:
df['Title'] = df['Name'].str.split(', ', expand=True)[1].str.split('.', expand=True)[0]

In [17]:
(df.groupby('Title').mean()['Survived']).sort_values(ascending=False)

Title
Dona      1.0
Miss      1.0
Mrs       1.0
Ms        1.0
Col       0.0
Dr        0.0
Master    0.0
Mr        0.0
Rev       0.0
Name: Survived, dtype: float64

In [18]:
df['Title'].value_counts()

Mr        240
Miss       78
Mrs        72
Master     21
Col         2
Rev         2
Dr          1
Dona        1
Ms          1
Name: Title, dtype: int64

#### Adding column is_Maried

In [19]:
df['Is_Married'] = 0
df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1

c:\users\rehman baba\appdata\local\programs\python\python39\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

### Data Pre-Processing

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_size,Family_type,Title,Is_Married
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1,0,Mr,0
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,2,1,Mrs,1
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1,0,Mr,0
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1,0,Mr,0
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,3,1,Mrs,1

In [21]:
df.drop(columns=['SibSp','Parch','Family_size','PassengerId','Name','Ticket','Cabin',],inplace=True)

In [22]:
df.head()

,Survived,Pclass,Sex,Age,Fare,Embarked,Family_type,Title,Is_Married
0,0,3,male,34.5,7.8292,Q,0,Mr,0
1,1,3,female,47.0,7.0000,S,1,Mrs,1
2,0,2,male,62.0,9.6875,Q,0,Mr,0
3,0,3,male,27.0,8.6625,S,0,Mr,0
4,1,3,female,22.0,12.2875,S,1,Mrs,1

In [23]:
df.isna().sum()

Survived        0
Pclass          0
Sex             0
Age            86
Fare            1
Embarked        0
Family_type     0
Title           0
Is_Married      0
dtype: int64

In [24]:
df['Age']

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64

In [25]:
df['Age'].mean().round()

30.0

In [26]:
df['Age']=df['Age'].fillna(df['Age'].mean().round())

In [27]:
df['Age']

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413    30.0
414    39.0
415    38.5
416    30.0
417    30.0
Name: Age, Length: 418, dtype: float64

In [28]:
df.head()

,Survived,Pclass,Sex,Age,Fare,Embarked,Family_type,Title,Is_Married
0,0,3,male,34.5,7.8292,Q,0,Mr,0
1,1,3,female,47.0,7.0000,S,1,Mrs,1
2,0,2,male,62.0,9.6875,Q,0,Mr,0
3,0,3,male,27.0,8.6625,S,0,Mr,0
4,1,3,female,22.0,12.2875,S,1,Mrs,1

In [29]:
df['Fare']=df['Fare'].fillna(df['Fare'].mean())

In [30]:
df.isna().sum()

Survived       0
Pclass         0
Sex            0
Age            0
Fare           0
Embarked       0
Family_type    0
Title          0
Is_Married     0
dtype: int64

# Modeling

In [72]:
from sklearn.model_selection import train_test_split, StratifiedKFold, GridSearchCV
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder,StandardScaler

In [32]:
x=df.iloc[:,1:]
y=df.iloc[:,0]

In [57]:
x.shape

(418, 8)

In [58]:
transformer=ColumnTransformer(transformers=[
    ('Scaling', StandardScaler(), ['Age','Fare']),
    ('OneHotEncoding', OneHotEncoder(drop='first',sparse=False), ['Sex', 'Embarked', 'Title'])

], remainder='passthrough')

In [59]:
x_traf=transformer.fit_transform(x)

In [60]:
x_traf.shape

(418, 16)

In [61]:
X_train, X_test, y_train, y_test = train_test_split( x_traf, y , test_size=0.2, random_state=42)

#### LogisticRegression

In [69]:
logreg = LogisticRegression()
logreg.fit(X_train, y_train)
y_pred_log = logreg.predict(X_test)
score=accuracy_score(y_test,y_pred_log )
print("Accuracy of LogisticRegression is",score*100)

Accuracy of LogisticRegression is 100.0

#### Gaussian Naive Bayes

In [68]:
gaussian = GaussianNB()
gaussian.fit(X_train, y_train)
y_pred_gau = gaussian.predict(X_test)
score=accuracy_score(y_test,y_pred_gau )
print("Accuracy of GaussianNB is",score*100)

Accuracy of GaussianNB is 100.0

#### Decision Tree

In [71]:
decision_tree = DecisionTreeClassifier()
decision_tree.fit(X_train, y_train)
y_pred_dt = decision_tree.predict(X_test)
score=accuracy_score(y_test,y_pred_dt )
print("Accuracy of DecisionTreeClassifier is",score*100)

Accuracy of DecisionTreeClassifier is 100.0

In [74]:
knn = KNeighborsClassifier(n_neighbors = 3)
knn.fit(X_train, y_train)
y_pred_knn = knn.predict(X_test)
score=accuracy_score(y_test,y_pred_knn)
print("Accuracy of DecisionTreeClassifier is",score*100)

Accuracy of DecisionTreeClassifier is 98.80952380952381